Repository: Ah95ed/B-Dare-link-
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Wonder Link
ar: رابط العجائب

# appSubtitle
source: Discover the hidden connection!
ar: اكتشف الصلة الخفية!

source: Start game
ar: ابدأ اللعب

# linkStart
source: Start Word
ar: الكلمة الأولى

# linkEnd
source: End Word
ar: الكلمة الأخيرة

# yourLink
source: Your Connection
ar: كيف ربطت بينهما؟

# submit
source: Link It!
ar: اربط!

# loading
source: Checking Link...
ar: جاري التحقق...

# winMessage
source: Amazing! You found the link!
ar: رائع! لقد وجدت الرابط!

# loseMessage
source: Not quite right. Try again!
ar: حاول مرة أخرى!

source: Steps
ar: خطوات

# changeLanguage
source: اللغة العربية
ar: English

# levelsTitle
source: Levels
ar: المراحل

source: Solo Play
ar: اللعب الفردي

source: Tournaments
ar: البطولات

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Login
ar: تسجيل الدخول

source: Register
ar: إنشاء حساب

source: Logout
ar: تسجيل الخروج

source: Delete Account
ar: حذف الحساب

# loginTitle
source: Login
ar: تسجيل الدخول

# registerTitle
source: Register
ar: إنشاء حساب جديد

source: Welcome Back!
ar: مرحباً بعودتك!

source: Create Account
ar: إنشاء حساب

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: New Password
ar: كلمة المرور الجديدة

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

# dontHaveAccount
source: Don't have an account? Register
ar: ليس لديك حساب؟ سجل الآن

# enterValidEmail
source: Enter a valid email
ar: أدخل بريداً إلكترونياً صحيحاً

# enterUsername
source: Enter a username
ar: أدخل اسم المستخدم

source: Password too short
ar: كلمة المرور قصيرة جداً

source: Login Failed
ar: فشل تسجيل الدخول

source: Registration Failed
ar: فشل إنشاء الحساب

# resetPasswordInstructions
source: Enter your registered email to receive a reset code.
ar: أدخل بريدك الإلكتروني المسجل لتلقي رمز التحقق.

source: Send OTP
ar: إرسال رمز التحقق

# verifyAndReset
source: Verify & Reset
ar: تحقق وأعد التعيين

# otpSent
source: OTP sent to {email}
ar: تم إرسال رمز التحقق إلى {email}

source: Failed to send OTP
ar: فشل إرسال رمز التحقق

# errorSendingOTP
source: Error sending OTP: {error}
ar: خطأ في إرسال رمز التحقق: {error}

source: Password reset successful
ar: تم إعادة تعيين كلمة المرور بنجاح

source: Invalid OTP
ar: رمز التحقق غير صحيح

# errorVerifyingOTP
source: Error verifying OTP: {error}
ar: خطأ في التحقق من الرمز: {error}

source: Level Complete!
ar: اكتملت المرحلة!

source: Level Completed!
ar: تم إكمال المرحلة!

# continueButton
source: Continue
ar: متابعة

source: Next
ar: التالي

source: Try again!
ar: حاول مرة أخرى!

# checkAnswer
source: Check
ar: تحقق

# amazing
source: Amazing! Path Found.
ar: رائع! وجدت الطريق.

# excellent
source: Excellent! Order Correct.
ar: ممتاز! الترتيب صحيح.

# wrongChoice
source: Wrong choice! Follow the chain.
ar: اختيار خاطئ! اتبع السلسلة.

source: Incorrect Order!
ar: الترتيب غير صحيح!

# greatJob
source: Great! You found the correct path.
ar: عظيم! لقد وجدت الإجابة الصحيحة.

# chooseCorrectOption
source: Choose the correct option
ar: اختر الإجابة الصحيحة

# whatLinks
source: What links "{start}" and "{end}"?
ar: ما الذي يربط بين "{start}" و "{end}"؟

# tapWordsInOrder
source: Tap words in order: {start} -> ... -> {end}
ar: اضغط على الكلمات بالترتيب: {start} <- ... <- {end}

# authRequired
source: To continue after level 3, please register or log in.
ar: للمتابعة بعد المرحلة الثالثة، يرجى التسجيل أو تسجيل الدخول.

# cantAdvanceWithoutLogin
source: You can't advance without logging in.
ar: لا يمكنك المتابعة دون تسجيل الدخول.

source: Back to levels
ar: العودة للمراحل

source: Coins
ar: العملات

source: Streak
ar: السلسلة

source: Badges
ar: الأوسمة

source: Daily Bonus!
ar: مكافأة يومية!

source: New streak started
ar: بدأت سلسلة جديدة

# streakDays
source: Streak: {days} days
ar: السلسلة: {days} أيام

source: Awesome!
ar: رائع!

source: Achievement Unlocked!
ar: إنجاز جديد!

source: Got it!
ar: حسناً!

source: Daily
ar: اليومي

source: Weekly
ar: الأسبوعي

source: Daily Challenge
ar: التحدي اليومي

source: Weekly Championship
ar: بطولة الأسبوع

source: Your Score
ar: نتيجتك

source: Your Rank
ar: ترتيبك

source: Play Now
ar: العب الآن

source: Today's Leaders
ar: المتصدرون اليوم

source: Weekly Standings
ar: ترتيب الأسبوع

# accumulatePointsWeekly
source: Accumulate points throughout the week!
ar: اجمع النقاط طوال الأسبوع!

# nextChallengeIn
source: Next challenge in: {hours}h {minutes}m
ar: التحدي القادم خلال: {hours} ساعة و {minutes} دقيقة

source: No data yet
ar: لا توجد بيانات بعد

source: Unknown
ar: غير معروف

# dailyChallengeWillOpen
source: Daily challenge will open here!
ar: سيفتح التحدي اليومي هنا!

source: Total Score
ar: النقاط الإجمالية

# deleteAccountConfirm
source: Delete Account?
ar: هل تريد حذف الحساب؟

# deleteAccountWarning
source: This action cannot be undone. All progress will be lost.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم فقدان كل التقدم.

source: Cancel
ar: إلغاء

source: DELETE
ar: حذف

source: AR Mode
ar: الواقع المعزز

source: Contextual Reality Start
ar: الواقع المعزز بالمعنى

# arInstructions
source: Capture a photo and we will transform it into a unique puzzle starting from your world!
ar: التقط صورة وسنحولها إلى لغز فريد ينطلق من عالمك!

source: Analyzing Image...
ar: جاري تحليل الصورة...

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# visionNotSupported
source: Vision scanning is not supported on Web yet.
ar: المسح البصري غير مدعوم على الويب حالياً.

# scannerNotSupported
source: Scanner not supported on Desktop yet. Use Android/iOS.
ar: الماسح غير مدعوم على سطح المكتب حالياً. استخدم Android أو iOS.

# errorPickingImage
source: Error picking image: {error}
ar: خطأ في اختيار الصورة: {error}

# failedToAnalyzeImage
source: Failed to analyze image. Try again.
ar: فشل تحليل الصورة. حاول مرة أخرى.

source: Choose Game Mode
ar: اختر نمط اللعب

source: Choices
ar: خيارات متعددة
